000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ДанныеПокупателя/ДанныеПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДанныеПокупателя</name>
</mdclass:DataProcessor>

000_РОЗНИЦА_ЦЕНТР/src/Enums/УчетныеСистемыКомпании/УчетныеСистемыКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УчетныеСистемыКомпании</name>
  <enumValues>
    <name>Magento</name>
  </enumValues>
  <enumValues>
    <name>MSDynCRM</name>
  </enumValues>
  <enumValues>
    <name>Navision</name>
  </enumValues>
  <enumValues>
    <name>Розница</name>
  </enumValues>
  <enumValues>
    <name>РозницаТестовая</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/НазначениеКонтрагентовОтложенных/НазначениеКонтрагентовОтложенных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначениеКонтрагентовОтложенных</name>
  <enumValues>
    <name>Magento</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаВРознице</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаВCRM</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Корзина</name>
      <description>КОРЗИНА</description>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
    <items>
      <name>Производители</name>
      <description>Производители</description>
    </items>
  </predefined>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоЕДРПОУ</name>
    <comment>(Регл) Код по ЕДРПОУ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСвидетельстваПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <comment>LNK. Может выступать в роли покупателя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>LNK. Может выступать в роли поставщика</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрямуюЗакупку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Дети</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Пол</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МаркетинговыеГруппы</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.МаркетинговыеГруппы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ДанныеПокупателя/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолноеИмя()	Экспорт

	Возврат Метаданные().ПолноеИмя();

КонецФункции

Функция ВнешняяОбработка()	Экспорт

	Если ТипЗнч(ЭтотОбъект) = Тип("ОбработкаОбъект." + Метаданные().Имя) Тогда

			ЭтоВнешняяОбработка = Ложь;

	Иначе	ЭтоВнешняяОбработка = Истина;

	КонецЕсли;

	Возврат ЭтоВнешняяОбработка;

КонецФункции

Функция РеквизитИмяСсылка(ИмяСсылка)	Экспорт

	ИмяРеквизита = ?(ОбщегоНазначенияРТповтИсп.ПолучитьУчетнуюПолитику().ИспользоватьУкраинскоеНаименование
		, "НаименованиеУкраинское"
		, "Наименование"
	);

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИмяСсылка, ИмяРеквизита, "", Ложь);

КонецФункции


//	LNK 22.08.2019 10:10:25
Функция УстановитьНовогоПокупателя(ДанныеКонтрагента, ДокументПродажи, ВыполнениеРегламента = Ложь)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Если РозничныеПродажиСлужебный.РесурсMicrosoftDynamicsДоступен() Тогда

		СоставДанных = ОбменMicrosoftDynamicsСервер.ИнициализироватьСоставДанных();
		АдресСервера = УправлениеДоступомСлужебныйПовтИсп.ПолучитьАдресСервераMSDynamics(ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин);

		Если НЕ ПустаяСтрока(АдресСервера) Тогда

			ПредставлениеКлиента = СтроковыеФункцииКлиентСервер.ПривестиНаименование(ДанныеКонтрагента.Фамилия + " " + ДанныеКонтрагента.Имя + " " + ДанныеКонтрагента.Отчество);

			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();

			ЗаписьJSON.ЗаписатьНачалоОбъекта();

				JSON.ЗаписатьСвойство("IDBASE", ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ИдентификаторУчетнойСистемы"), ЗаписьJSON);
				JSON.ЗаписатьСвойство("message1C", -1, ЗаписьJSON);

				JSON.ЗаписатьСвойство("phoneNumber", ДанныеКонтрагента.НомерТелефона, ЗаписьJSON);
				JSON.ЗаписатьСвойство("cardNumber" , "", ЗаписьJSON);
				JSON.ЗаписатьСвойство("firstName"  , ДанныеКонтрагента.Имя, ЗаписьJSON);
				JSON.ЗаписатьСвойство("midleName"  , ДанныеКонтрагента.Отчество, ЗаписьJSON);
				JSON.ЗаписатьСвойство("lastName"   , ДанныеКонтрагента.Фамилия, ЗаписьJSON);
				JSON.ЗаписатьСвойство("gender"     , ОбменMicrosoftDynamicsПовтИсп.ПолДляCRM(ДанныеКонтрагента.Пол, "число"), ЗаписьJSON);
				JSON.ЗаписатьСвойство("email"      , ДанныеКонтрагента.Email, ЗаписьJSON);
				JSON.ЗаписатьСвойство("IDD_store"  , ОбменMicrosoftDynamicsПовтИсп.ИдентификаторМагазина(ДанныеКонтрагента.Магазин, Перечисления.УчетныеСистемыКомпании.MSDynCRM), ЗаписьJSON);
				JSON.ЗаписатьСвойство("manager"    , СокрЛП(ДанныеКонтрагента.ТекущийПользователь.УникальныйИдентификатор()), ЗаписьJSON);

				ЗаписьJSON.ЗаписатьИмяСвойства("children");
				ЗаписьJSON.ЗаписатьНачалоМассива();
				ЗаписьJSON.ЗаписатьКонецМассива();

			ЗаписьJSON.ЗаписатьКонецОбъекта();

			ТекстЗапроса = ЗаписьJSON.Закрыть();

			ЖурналСобытий.Регистрация("CRM.Контрагент.Новый", УровеньЖурналаРегистрации.Примечание
				, Метаданные.ПланыОбмена.ОбменMicrosoftDynamics
				,
				,
				, ТекстЗапроса
				,
				,
				Ложь
			);	//	LNK 18.05.2020 06:19:04

			Результат = ОбменMicrosoftDynamicsСервер.ВыполнитьЗапросКСерверу("/api/Orders/CustomerRegistration", ТекстЗапроса, АдресСервера, "POST",, 10);

			Если ТипЗнч(Результат.ДанныеОтвета) = Тип("Структура") Тогда

				Если НЕ ПустаяСтрока(Результат.ДанныеОтвета.error) Тогда

					СоставДанных.Ошибка = Истина;
					СоставДанных.ОписаниеОшибки = Результат.ДанныеОтвета.error;

				ИначеЕсли ТипЗнч(Результат.ДанныеОтвета.Data) = Тип("Структура") Тогда

				//	перезаполним "ДанныеКонтрагента" в соответствии с полученной информацией от внешней системы
					ДанныеКонтрагента = ОбменMicrosoftDynamicsСервер.ЗаполнитьСтруктуруПоВнешнимДанным(ДанныеКонтрагента, Результат.ДанныеОтвета.Data);

					Если Справочники.Контрагенты.КлючиПоискаУказаны(ДанныеКонтрагента) Тогда

						ДанныеКонтрагента.ОтключитьМеханизмРегистрацииMicrosoftDynamics = Истина;

						СоставДанных = РозничныеПродажиСлужебный.ВыполнитьКомплексДанныхКонтрагента(
							  ""
							, ДанныеКонтрагента.НомерТелефона
							, ДанныеКонтрагента
							, Перечисления.НазначениеКонтрагентовОтложенных.ПроверкаВРознице
							, ДокументПродажи
							, ВыполнениеРегламента
						);

						Если СоставДанных.Ошибка Тогда

							Если НЕ ПустаяСтрока(СоставДанных.ОписаниеОшибки) Тогда

									СоставДанных.ОписаниеОшибки = СоставДанных.ОписаниеОшибки;

							Иначе	СоставДанных.ОписаниеОшибки = "При поиске/записи контрагента возникла неизвестная ошибка.";

							КонецЕсли;

						Иначе
							
							ДанныеКонтрагента = СоставДанных;	//	переопределим.

						КонецЕсли;

					Иначе

						СоставДанных.Ошибка = Истина;
						СоставДанных.ОписаниеОшибки = "Отказано! Ключи поиска контрагента НЕ указаны (IDC, IDD, IDN или номер телефона).";

					КонецЕсли;

				Иначе

					СоставДанных.Ошибка = Истина;
					СоставДанных.ОписаниеОшибки = "Сервер CRM вернул неожиданные данные!" + Символы.ПС
												+ "(" + СокрЛП(Результат.ДанныеОтвета.Data) + ")";

				КонецЕсли;

			Иначе

				СоставДанных.Ошибка = Истина;
				СоставДанных.ОписаниеОшибки = "Сервер CRM вернул неожиданные данные!" + Символы.ПС
											+ "(" + СокрЛП(Результат.ДанныеОтвета) + ")";

			КонецЕсли;

			Если СоставДанных.Ошибка Тогда

				ЖурналСобытий.Регистрация(ОбменMicrosoftDynamicsПовтИсп.ИмяСобытияЖурнала() + ".УстановитьНовогоПокупателя"
				, УровеньЖурналаРегистрации.Ошибка
				,
				,
				,
				, "Данные ответа: " + СоставДанных.ОписаниеОшибки
				+ Символы.ПС + Символы.ПС + "(out)JSON:" + Символы.ПС + ТекстЗапроса
				, ПредставлениеКлиента + " (" + ДанныеКонтрагента.НомерТелефона + ")"
				, Истина);

			КонецЕсли;

		Иначе

			СоставДанных.Ошибка = Истина;
			СоставДанных.ОписаниеОшибки = "CRM: адрес сервера НЕ указан.";

		КонецЕсли;

	Иначе

		СоставДанных = ОбменMicrosoftDynamicsСервер.ИнициализироватьСоставДанных();

		Попытка

			Справочники.Контрагенты.ОтложитьДанныеКонтрагента("", ДанныеКонтрагента.НомерТелефона, ДанныеКонтрагента
				, Перечисления.НазначениеКонтрагентовОтложенных.ПроверкаВCRM
				, ДокументПродажи, ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин);

			СоставДанных.Отложено = Истина;
			СоставДанных.ОписаниеОшибки =
				"Введенные данные отложены для обработки после
				|восстановления соединения.";

		Исключение

			СоставДанных.Ошибка = Истина;
			СоставДанных.ОписаниеОшибки = ОписаниеОшибки();

		КонецПопытки;

	КонецЕсли;

	Возврат СоставДанных;

КонецФункции

#КонецЕсли
